/////////////////////////////////////////////////////////////////////////////////
// Глобальный
//  
/////////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции, предназначенные для использования другими 
// объектами конфигурации или другими программами
///////////////////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс

// глВыполнитьДействие1
//	Гл выполнить действие1
//
// Параметры:
//  Параметр1	 - Произвольный	 - Входящий параметр
//  Параметр2	 - Произвольный	 - Входящий параметр
//
Процедура глВыполнитьДействие1(Параметр1, Параметр2 = "") Экспорт 
	
	Сообщить(глПолучитьДанные());
	
КонецПроцедуры

// глПолучитьДанные
//	Гл получить данные
//
// Параметры:
//  Параметр1	 - Произвольный	 - Входящий параметр
//  Параметр2	 - Произвольный	 - Входящий параметр
//  Параметр3	 - Произвольный	 - Входящий параметр
// 
// Возвращаемое значение:
//  Произвольный - Результат
//
Функция глПолучитьДанные(Параметр1 = 1, Параметр2 = 2, Параметр3 = 4) Экспорт
	
	Возврат "Результат метода ПолучитьДанные";
	
КонецФункции

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции для служебного использования внутри подсистемы
///////////////////////////////////////////////////////////////////////////////// 

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, составляющие внутреннюю реализацию модуля 
///////////////////////////////////////////////////////////////////////////////// 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти